docs/leets/1105-Filling-Bookcase-Shelves.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1105. Filling Bookcase Shelves</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-30
</div>
<div id="content" class="content">
<header>
<h1 class="title">1105. Filling Bookcase Shelves</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd9bf611">Submission</a></li>
<li><a href="#orgf4d9e67">Problem:</a></li>
<li><a href="#org484f89e">The task is to design an algorithm that minimizes the total height of the bookcase by optimally placing books on the shelves.</a></li>
<li><a href="#org683af91">Example Test Case:</a></li>
<li><a href="#org057c28f">Solution Description:</a></li>
<li><a href="#orga3e48f6">Example:</a>
<ul>
<li><a href="#org78c59a4">Code Implementation</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div id="outline-container-orgd9bf611" class="outline-2">
<h2 id="orgd9bf611">Submission</h2>
<div class="outline-text-2" id="text-orgd9bf611">
<ul class="org-ul">
<li><a href="https://leetcode.com/submissions/detail/1339094172/">2024-07-31 Filling Bookcase Shelves - Submission Detail - LeetCode</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf4d9e67" class="outline-2">
<h2 id="orgf4d9e67">Problem:</h2>
<div class="outline-text-2" id="text-orgf4d9e67">
<p>
The problem is to fill a bookcase with books, each with a given width and height, such that the total height of the shelves is minimized. We are given a list `books` where `books[i] = [width<sub>i</sub>, height<sub>i</sub>]` represents the width and height of the i-th book. The books must be placed in the order given. The width of each shelf is fixed and given by an integer `shelf<sub>width</sub>`. Books can be placed on multiple shelves, but their relative ordering must stay the same.
</p>
</div>
</div>

<div id="outline-container-org484f89e" class="outline-2">
<h2 id="org484f89e">The task is to design an algorithm that minimizes the total height of the bookcase by optimally placing books on the shelves.</h2>
</div>

<div id="outline-container-org683af91" class="outline-2">
<h2 id="org683af91">Example Test Case:</h2>
<div class="outline-text-2" id="text-org683af91">
<ul class="org-ul">
<li>Example 1:
Input: `books = [[1, 3], [2, 4], [2, 2]]`, `shelf<sub>width</sub> = 4`
Output: `6`
Explanation:
<ul class="org-ul">
<li>Place [1, 3] and [2, 2] on the first shelf, height = 3.</li>
<li>Place [2, 4] on the second shelf, height = 4.</li>
<li>Total height = 3 + 4 = 7.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org057c28f" class="outline-2">
<h2 id="org057c28f">Solution Description:</h2>
<div class="outline-text-2" id="text-org057c28f">
<p>
To implement the solution optimally, we need to use dynamic programming. We will create a DP array where dp[i] represents the minimum possible height to arrange the first i books. For each book, we will iterate backward to check the possibility of placing the book on the current shelf or moving it to a new shelf. By doing this, we ensure we are considering all possible configurations and thus finding the minimal height configuration.
</p>

<ul class="org-ul">
<li>Time Complexity: O(n * n) due to nested iteration.</li>
<li>Space Complexity: O(n) for storing the DP array.</li>
</ul>
</div>
</div>

<div id="outline-container-orga3e48f6" class="outline-2">
<h2 id="orga3e48f6">Example:</h2>
<div class="outline-text-2" id="text-orga3e48f6">
<p>
Consider `books = [[1, 3], [2, 4], [2, 2]]` and `shelf<sub>width</sub> = 4`.
</p>
<ul class="org-ul">
<li>We start from the first book: [1,3]. The height is 3.</li>
<li>Move to the second book [2, 4]. At this point, putting it with the first creates shelf height 4 but exceeds width.</li>
<li>We then calculate optimal config by shifting to the next shelf if needed, checking minimum height each step.</li>
</ul>
</div>

<div id="outline-container-org78c59a4" class="outline-3">
<h3 id="org78c59a4">Code Implementation</h3>
<div class="outline-text-3" id="text-org78c59a4">
<p>
Below is the framework of the solution:
</p>

<div class="org-src-container">
<pre class="src src-js">
/**
 * Main function to solve the problem.
 * @param {number[][]} books - Array of books with width and height.
 * @param {number} shelfWidth - Width of each shelf.
 * @returns {number} - Minimum height of the bookcase shelves.
 */
function minHeightShelves(books, shelfWidth) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;

    const n = books.length;
    const dp = new Array(n + 1).fill(Infinity);
    const width = 0;
    const height = 1;
    dp[0] = 0; // No books, no height needed

    log(`books=${JSON.stringify(books)}; shelfWidth=${shelfWidth}`);
    log(`dp00=${JSON.stringify(dp)}`);
    for (let i = 1; i &lt;= n; i++) {
        let totalWidth = 0;
        let maxHeight = 0;
        for (let j = i; j &gt; 0; j--) {
            totalWidth += books[j - 1][width];
            if (totalWidth &gt; shelfWidth) break;
            maxHeight = Math.max(maxHeight, books[j - 1][height]);
            dp[i] = Math.min(dp[i], dp[j - 1] + maxHeight);
        }
    }

    log(`dp01=${JSON.stringify(dp)}`);

    return dp[n];
}

// Test cases
const testCases = [
    { books: [[1, 3], [2, 4], [2, 2]], shelfWidth: 4, expected: 6 },
    { books: [[1,1],[2,3],[2,3],[1,1],[1,1],[1,1],[1,2]], shelfWidth: 4, expected: 6 },
    { books: [[1,3],[2,4],[3,2]], shelfWidth: 6, expected: 4 },
    { books: [], shelfWidth: 4, expected: 0 },
];

testCases.forEach((test, index) =&gt; {
    const result = minHeightShelves(test.books, test.shelfWidth);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
